app/controllers/match_controller.rb

SELECT "championbases".* FROM "championbases" WHERE "championbases"."champion_id" = $1  [["champion_id", "31"]]
---
	def current_match

		if params[:summoner_id]

			match_request = "https://na.api.pvp.net/observer-mode/rest/consumer/getSpectatorGameInfo/NA1/#{params[:summoner_id]}?api_key=#{ENV['RIOT_KEY']}"
			response = HTTParty.get(match_request).parsed_response

			new_match = Match.new()
			new_match.match_id = response['gameId']
			new_match.platform_id = response['platformId']

			response['participants'].each do |participant|
				p participant
				spell_1 = participant['spell1Id']
				spell_2 = participant['spell2Id']

				base_champion = Championbase.where(champion_id: participant['championId'])

INSERT INTO "matches" ("participants", "match_id", "platform_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["participants", "{21915371}"], ["match_id", "2224016281"], ["platform_id", "NA1"], ["created_at", "2016-06-25 10:58:52.659431"], ["updated_at", "2016-06-25 10:58:52.659431"]]
SELECT "matches".* FROM "matches" WHERE "matches"."match_id" = $1  [["match_id", "2224016281"]]
---
			p '-- New Match --'
			p new_match

			if new_match.save
				p 'Match was saved!'
				p match = Match.where(match_id: new_match.match_id.to_s)