app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "rhoxiodbc@gmail.com"]]
---
  def create
  	user = User.find_by_email(params[:email])