app/controllers/summoners_controller.rb

INSERT INTO "summoners" ("name", "summoner_id", "icon_id", "level", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "azorius07"], ["summoner_id", "21915371"], ["icon_id", 1113], ["level", 30], ["created_at", "2016-06-23 01:42:08.399319"], ["updated_at", "2016-06-23 01:42:08.399319"]]
---
  def get
    request = "https://na.api.pvp.net/api/lol/na/v1.4/summoner/by-name/#{params["summoner_name"]}?api_key=#{ENV['RIOT_KEY']}"
    response = HTTParty.get(request)
    # ap response.parsed_response

    if !response.parsed_response.key?('status')

      @summoner = Summoner.new()
      new_summoner = response.parsed_response

      @summoner.name = new_summoner.keys[0]
      @summoner.summoner_id = new_summoner.values[0]['id']
      @summoner.icon_id = new_summoner.values[0]['profileIconId']
      @summoner.level = new_summoner.values[0]['summonerLevel']

      if @summoner.save