app/controllers/users_controller.rb

	def create
    user = User.new(user_params)

    if params["summoner_name"]

    	request = "https://na.api.pvp.net/api/lol/na/v1.4/summoner/by-name/#{params["summoner_name"]}?api_key=#{ENV['RIOT_KEY']}"
			response = HTTParty.get(request)

			response.parsed_response.each do |key, value|
				p key
				p value

				# If key is the same as summoner_name.downcase...
				user.summoner_id = value['id']
				user.summoner_icon = value['profileIconId']
			end

    else
    	p 'no summoner to find'
    end

    if user.save
---
INSERT INTO "summoners" ("name", "summoner_id", "level", "icon_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Azorius07"], ["summoner_id", "21915371"], ["level", 30], ["icon_id", 1113], ["created_at", "2016-06-21 08:33:12.023833"], ["updated_at", "2016-06-21 08:33:12.023833"]]
INSERT INTO "users" ("name", "email", "password_digest", "summoner_id", "summoner_icon", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"